# lab1_task1.py
# Задание 1: квадраты и кубы чисел от 1 до N

n = int(input("Введите натуральное число (не больше 100): "))

for i in range(1, n + 1):
    print(f"{i}^2 = {i ** 2}, {i}^3 = {i ** 3}")
